{
  "_name_or_path": "albert_xl/vitc_mnli/checkpoint-10000",
  "architectures": [
    "AlbertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 2,
  "classifier_dropout_prob": 0.1,
  "down_scale_factor": 1,
  "embedding_size": 128,
  "eos_token_id": 3,
  "finetuning_task": [
    "mnli",
    "vitc_real",
    "vitc_synthetic"
  ],
  "gap_size": 0,
  "hidden_act": "gelu_new",
  "hidden_dropout_prob": 0,
  "hidden_size": 2048,
  "id2label": {
    "0": "SUPPORTS",
    "1": "REFUTES",
    "2": "NOT ENOUGH INFO"
  },
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 8192,
  "label2id": {
    "NOT ENOUGH INFO": "2",
    "REFUTES": "1",
    "SUPPORTS": "0"
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "albert",
  "net_structure_type": 0,
  "num_attention_heads": 16,
  "num_hidden_groups": 1,
  "num_hidden_layers": 24,
  "num_memory_blocks": 0,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.3.3",
  "type_vocab_size": 2,
  "vocab_size": 30000
}
